In [1]:
import pandas as pd
import numpy as np

In [6]:
#Read the customer ratings data into the ratings dataFrame ratings_frame
ratings_frame = pd.read_csv('Documents/RECOMMENDATION_SYSTEM/01_02/rating_final.csv')

#Read the cuisine data into the ratings dataFrame cuisine_frame
cuisine_frame = pd.read_csv('Documents/RECOMMENDATION_SYSTEM/01_02/chefmozcuisine.csv')

In [8]:
#Display the top customer ratings dataset

ratings_frame.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [9]:
#Display same for the cuisine dataFrame
cuisine_frame.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

In [21]:
#Make recommendation based on simple counting
ratings_count = pd.DataFrame(ratings_frame.groupby('placeID')['rating'].count()) #Group by place ID, pick the rating column and count into new dataframe

In [25]:
#Sort the ratings in descending order

ratings_count.sort_values('rating', ascending = False).head()

         rating
placeID
135085       36
132825       32
135032       28
135052       25
132834       25

In [29]:
#put most rated places into a dataFrame 

most_rated = pd.DataFrame([135085, 132825, 135032, 135052, 132834], index = np.arange(5),columns = ['placeID'])

In [30]:
#Now merge the most rated places with the cuisine on place ID

pd.merge(most_rated, cuisine_frame, on = 'placeID')

   placeID         Rcuisine
0   135085        Fast_Food
1   132825          Mexican
2   135032        Cafeteria
3   135032     Contemporary
4   135052              Bar
5   135052  Bar_Pub_Brewery
6   132834          Mexican

In [31]:
#The dataset shows the type of cuisine served in the most popular places
cuisine_frame['Rcuisine'].describe()

count         916
unique         59
top       Mexican
freq          239
Name: Rcuisine, dtype: object

In [ ]:
#It is clear from the above that Mexico is likely recommended because they serve the best cuisine